# Read And Write Files And Some Basic Methods Attributes  读取和写入文件及一些基本方法属性

In [3]:
import pandas as pd
import numpy as np

## 1. Read and Write Files  读取和写入文件

### a. Reading Data Files  读取数据文件
- Data exists in a number of formats. The most basic of these is the CSV file. CSV stands for comma-separated-values. 数据以多种格式存在。其中最基本的是 CSV 文件。CSV 代表逗号分隔值。
- What is a CSV file?  什么是 CSV 文件？
    - A CSV file is a text file that contains data separated by commas.  CSV 文件是一个文本文件，其中包含由逗号分隔的数据。

### b. Working with CSV files in Python  在 Python 中处理 CSV 文件
- For working with CSV files in python, there is an inbuilt module named csv.  要在 Python 中处理 CSV 文件，有一个名为 csv 的内置模块。
- However, a common method for working with CSV files is using Pandas. It makes importing and analyzing data much easier.  然而，处理 CSV 文件的一个常用方法是使用 Pandas。它使导入和分析数据变得更加容易。
- One crucial feature of Pandas is its ability to write and read Excel, CSV, and many other common types of files.  Pandas 的一个重要功能是能够读写 Excel、CSV 以及许多其他常见类型的文件。

### c. Pandas read_csv
- The read_csv() function reads the CSV file into a DataFrame object.  read_csv()函数将 CSV 文件读取到一个 DataFrame 对象中。
- A CSV file is similar to a two-dimensional table and the DataFrame object represents two dimensional tabular view.  一个 CSV 文件类似于一个二维表格，DataFrame 对象表示二维表格视图。
- The most basic way to read a csv file in Pandas:  Pandas 读取 csv 文件最基本的方法：

In [4]:
# Read a CSV file into a DataFrame
# df = pd.read_csv('data.csv')

NameError: name 'pwd' is not defined

### d. Pandas to_csv with example  Pandas to_csv 示例

In [ ]:
# DataFrame to CSV
# df is the name of the DataFrame you want to write to a CSV file.
# df.to_csv('data.csv')

# if you don't want to write the index column to the CSV file, you can set the index parameter to False:
# df.to_csv('data.csv', index=False)

## 2. Basic Methods and Attributes - On Real World Dataset  基本方法和属性 - 在真实世界数据集上

### a. Read The dataset  阅读数据集

In [10]:
exam_scores = pd.read_csv('data/exam_scores.csv')

### b. Methods and Attributes of DataFrame  DataFrame 的方法和属性

In [11]:
# shape attribute  形状属性
exam_scores.shape

(1000, 8)

In [12]:
# head( ) method  head()方法
exam_scores.head()  # Returns the first 5 rows of the DataFrame

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71

In [13]:
# tail( ) method  tail()方法
exam_scores.tail()  # Returns the last 5 rows of the DataFrame

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group C,some high school,standard,none,68,77,72
996,female,group E,some college,standard,none,98,81,94
997,female,group E,associate's degree,free/reduced,none,67,67,67
998,female,group C,high school,standard,none,63,68,70
999,male,group C,some college,free/reduced,none,49,57,50

In [14]:
# head( ) and tail( )
# You can also specify the number of rows to return by passing an integer argument to the head() or tail() method.
exam_scores.head(10)  # Returns the first 10 rows of the DataFrame
# exam_scores.tail(10)  # Returns the last 10 rows of the DataFrame

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71
5,female,group D,associate's degree,standard,completed,75,82,85
6,female,group B,associate's degree,free/reduced,none,69,78,80
7,male,group E,some high school,free/reduced,none,54,50,48
8,male,group C,some high school,standard,completed,65,58,55
9,male,group B,master's degree,standard,none,87,75,79

In [15]:
# dtypes
exam_scores.dtypes  # Returns the data types of each column in the DataFrame

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [16]:
# info( ) method  info()方法
exam_scores.info()  # Returns a summary of the DataFrame, including the number of non-null values and data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

## 3. Exercise  练习

In [22]:
sma_data = pd.read_csv('data/Standard_Metropolitan_Areas_Data-data.csv')

In [23]:
sma_data.shape  # Returns the shape of the DataFrame

(99, 10)

In [25]:
sma_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   land_area       99 non-null     int64
 1   percent_city    99 non-null     float64
 2   percent_senior  99 non-null     float64
 3   physicians      99 non-null     int64
 4   hospital_beds   99 non-null     int64
 5   graduates       99 non-null     float64
 6   work_force      99 non-null     float64
 7   income          99 non-null     int64
 8   region          99 non-null     int64
 9   crime_rate      99 non-null     float64
dtypes: float64(5), int64(5)
memory usage: 7.9 KB